[
    {
    "title": "US Domestic Gross Box Office - Deneb Remake #1",
    "date": "2025-05-16",
    "content": "<p>Inspired by a chart in <a href='https://www.trendlineHQ.com'>www.trendlineHQ.com</a>, I recreated the following visual using Vega-Lite inside a Deneb custom visual in Power BI.</p><figure><img src='/images/USDomesticBoxOffice_Original.png' alt='Original Visualisation' '><figcaption>Original Visualisation</figcaption></figure><br><h3>Background</h3><p>This was an interesting visual to me and showed simply the stark effect of COVID-19 on cinema-goers in the US. I also thought it was a nice simple remake to start with.</p><p>I felt the little caption / narrative emphasising the change from 2019 would be the tricky part and I wanted to investigate whether this was possible in Deneb.</p><h3>Tools Used</h3><ul><li>Power BI</li><li>Vega-Lite</li><li>Deneb custom visual</li><li>HTML5 Content custom visual</li></ul><h3>Steps</h3><h4>Create the column chart</h4><p>A measure was created in Power BI to sum up the total Box Office Gross value.</p><p>A bar mark was then used within Vega-Lite. This was encoded with the measure for the y-axis and the year for the x-axis.</p><p>A parameter was used in the config to hold the hex colour for the columns. This was then referenced in the mark.</p><h4>Technical detail</h4><p>Since the dataset began in 1977, a transform filter was used to ensure the x-axis began with the year 2000 to mimic the original.</p><p>The label angle for the years was set to 0 as by default they were displayed sideways.</p><p>A title was added as well as a subtitle. The value of these were strings.</p><p>The formatting of the y-axis needed to reflect the fact that it was a currency and, in addition, was quoted in billions. This was achieved using a label expression in the axisY property in the config. This expression said if the label value is zero, return that value, otherwise append '$' to the formatted value.</p><p>The last thing was the arrows which are made using point marks and set styles.</p><p>So, in the config we created two styles (_arrowdown and _arrowleft) and then in the specification, layered two point marks with the bar mark. The point marks would then reference each of the styles created.</p><h3>Compromises</h3><p>There were a couple of things outside the scope of Deneb. It is only possible to have one title and one subtitle per visual so I was unable to create the three lines of titling as per the original. Or rather I was unable to format three lines in three different ways. Hence the headline is actually a Power BI card.</p><p>The narrative on the right hand side was also not possible in Deneb. It is not possible to format a substring in a different way to the rest of the string. This is also not possible in native Power BI. To achieve this with the red and green text colouring I used another custom visual called HTML Content which allows you to write in HTML with inline CSS styling.</p><h3>Outcome</h3><figure><img src='/images/USDomesticBoxOffice_Remake.png' alt='Vega-Lite Remake' style='width:1000px'><figcaption>My Deneb Remake</figcaption>"
  },
  {
    "title": "Deneb Remakes",
    "date": "2025-05-15",
        "content": "<p>Deneb is a custom visual in Power BI which allows you to use Vega-Lite grammar to create your own visuals. Ever since I found out about Deneb in around 2021, I have been fascinated and enthralled by the power it can wield within Power BI. I have also, if I'm honest, been frustrated in almost equal measure along the learning journey!</p><p>I've always wanted to improve my ability with the Vega-Lite grammar which the Deneb visual uses. This mini-project felt like a really good way to get hands-on and develop and hone my skills and understanding.</p><p>The idea is quite simple: scour the internet for interesting visuals and see if I can re-create them inside Power BI using the Deneb custom visual.</p>"
  }

]
